coding = {
    "А": "110111",
    "Б": "11111101",
    "В": "11100",
    "Г": "1111111100",
    "Д": "1110110",
    "Е": "0110",
    "Ж": "1111111111",
    "З": "1111111101",
    "И": "00",
    "Й": "1111010",
    "К": "1111011",
    "Л": "111010",
    "М": "10111",
    "Н": "100",
    "О": "0111",
    "П": "110110",
    "Р": "10110",
    "С": "11010",
    "Т": "1010",
    "У": "111111100",
    "Ф": "1111001",
    "Х": "11111010",
    "Ц": "1110111",
    "Ч": "11111100",
    "Ш": "1111111110",
    "Щ": "111111101",
    "Ы": "1111100",
    "Ь": "11111011",
    "Э": "1111000",
    "Я": "1100",
    " ": "010",
}

s_prime = "ЭНТРОПИЯ В ТЕОРИИ ИНФОРМАЦИИ ЕСТЬ МЕРА ИЛИ СТЕПЕНЬ НЕОПРЕДЕЛЕННОСТИ СИТЕМЫ В ТЕОРИИ ИНФОРМАЦИИ ПОД ЭНТРОПИЕЙ ПОНИМАЕТСЯ МЕРА НЕОПРЕДЕЛЕННОСТИ ИСТОЧНИКА СООБЩЕНИЙ ОПРЕДЕЛЯЕМАЯ ВЕРОЯТНОСТЯМИ ПОЯВЛЕНИЯ ТЕХ ИЛИ ИНЫХ СИМВОЛОВ ПРИ ИХ ПЕРЕДАЧЕ В МАТЕМАТИКЕ И КИБЕРНЕТИКЕ ИНФОРМАЦИЯ ЯВЛЯЕТСЯ МЕРОЙ УСТРАНЕНИЯ НЕОПРЕДЕЛЕННОСТИ ЭНТРОПИИ МЕРОЙ ОРГАНИЗАЦИИ СИСТЕМЫ СООТНОШЕНИЕ МЕЖДУ ПОНЯТИЯМИ ЭНТРОПИЯ И ИНФОРМАЦИЯ В"


def foo(s1: str, s2: str) -> float:
    count = 0
    for i in range(len(s1)):
        if s1[i] != s2[i]:
            count += 1

    return (length - count) / length


def code(s: str) -> str:
    for k, v in coding.items():
        s = s.replace(k, v)

    return s


s1_real = "НТРОПИЯ В ТЕОРИИ ИНФОРМА"
s1_err = "НТРАПИЯ В ТЕОРИИ ИНФОРМО"
s1_real = code(s1_real)
s1_err = code(s1_err)

s2_real = "НТРОПИЯ В ТЕОРИИ ИНФОРМА"
s2_fake = "МТРАПИЯ В ТЕОРИИ ИНФОРНО"
s2_real = code(s2_real)
s2_fake = code(s2_fake)

s3_real = "НТРОПИЯ В ТЕОРИИ ИНФОРМА"
s3_fake = "МТРАПЕЯ В ТИОРИИ ИНФОРНО"
s3_real = code(s3_real)
s3_fake = code(s3_fake)

s4_real = "НТРОПИЯ В ТЕОРИИ ИНФОРМА"
s4_fake = "МТПАРЕЯ В ТИОРИИ ИНФОРНО"
s4_real = code(s4_real)
s4_fake = code(s4_fake)

s_prime = code(s_prime)
length = len(s_prime)

p1 = foo(s1_real, s1_err)
p2 = foo(s2_fake, s2_real)
p3 = foo(s3_fake, s3_real)
p4 = foo(s4_fake, s4_real)

print(s1_real, "\n", s1_err)
print(s2_real, "\n", s2_fake)
print(s3_real, "\n", s3_fake)
print(s4_real, "\n", s4_fake)
print(f"p1 = {p1}, p2 = {p2}, p3 = {p3}, p4 = {p4}, length = {length}")
